{
  "name": "Abhisek G. Mahapatra",
  "meta": {
    "format": "FRESH@0.6.0",
    "version": "0.1.0"
  },
  "info": {
    "label": "Automation/DevOps Engineer. Former IBM i Senior Software Developer",
    "brief": "I started my career as an Associate Graduate Trainee in 2011 after completing my Bachelor's Degree in Computer Science and have been associated with the IT industry since then, assuming diverse roles and responsibilities during this period.<br></br>Initially, I worked as Software Developer on IBM i platform working on a Canadian mutual fund/insurance product primarily involved in developing and delivering software solutions. Later while I was promoted as a Senior Software Developer, I was involved in designing the technical solution and consulted on a critical functional module of the product, while engaged in other tasks like code deployment, testing support and production troubleshooting.<br></br> Next, I worked as a Senior Consultant for a healthcare client based in North Carolina supporting and maintaining production critical applications.<br></br>Currently, I am working in an automation/DevOps role that involves creating automated solutions for IBM i admin operations activities as well as setting up IBM i devices for monitoring and support that leverages my skills on scripting (Python, JavaScript, Java, Bash Scripting) as well as my strong background on IBM i platform.",
    "image": ""
  },
  "contact": {
    "website": "http://ovisek.github.io",
    "phone": "+91 8056128320",
    "email": "abhisek.g.mahapatra@gmail.com",
    "other": []
  },
  "location": {
    "address": "",
    "city": "Bengaluru",
    "region": "Karnataka",
    "code": "560037",
    "country": "IN"
  },
  "social": [
    {
      "label": "",
      "network": "GitHub",
      "user": "ovisek",
      "url": "https://github.com/ovisek"
    },
    {
      "label": "",
      "network": "LinkedIn",
      "user": "abhisekgmahapatra",
      "url": "https://www.linkedin.com/in/abhisekgmahapatra/"
    }
  ],
  "employment": {
    "summary": "",
    "history": [
      {
        "employer": "IPsoft Global Services",
        "url": "http://ipsoft.com",
        "position": "Senior iSeries Engineer",
        "summary": "I am working as an Automation / DevOps engineer with a strong background on IBM i / AS400 / iSeries platform application programming. My current role is that of an independent developer working closely with the AS400 operations team with responsibilities involving understanding the operations needs and challenges, identifying automation opportunities and implementing solutions contributing to continuous service improvement.",
        "start": "2016-03",
        "keywords": [
          "Automation",
          "DevOps",
          "Scripting",
	  "IBM i"
        ],
        "highlights": [
          "Creating monitoring checks and automatons (IPautomata) for IBM i servers.",
          "Maintaining and supporting IPcenter infrastructure (IPadmin/IPcmdb/IPdiscover).",
          "Deploying monitoring checks for new or existing customers.",
	  "Conduct technical sessions and educate team to enable better productivity and efficiency in their day to day tasks."
        ]
      },
      {
        "employer": "NTT Data",
        "url": "https://www.nttdata.com/global/en/",
        "position": "Senior Consultant",
        "summary": "",
        "start": "2015-03",
        "end": "2016-03",
        "keywords": [
          "IBM i",
          "development",
          "maintenance",
          "production support"
        ],
        "highlights": ["Troubleshooting production critical issues and providing prompt and accurate resolution and act as the primary on-call contact.","Research and creating code design based on the requirement, coding, and unit testing and implementing the change to production.","Reviewing the code and design and providing suggestions and feedback.","Train and guide the new recruits, conduct technical sessions, share technical tips and knowledge.","Coordinate with teams from different streams and work closely with them to understand and identify the interdependence for faster identification and resolution of issues."
        ]
      },
      {
        "employer": "LTI",
        "url": "https://www.lntinfotech.com/canada/products/",
        "position": "Senior Software Developer",
        "summary": "",
        "start": "2011-11",
        "end": "2015-03",
        "keywords": [
          "IBM i",
          "development",
          "testing",
	  "deployment",
          "production support"
        ],
        "highlights": ["Implementing the technical design into application code.","Analyzing and understanding the business and functional requirement and modelling the technical design based on it.","Designing test case and performing unit testing and integration testing.","Provide technical support and troubleshooting in client production environment and act as primary pager contact.","Involved during source comparison activities and production release support.","During client onboarding acted as sole Offshore developer for Conversion activities","Worked extensively on SEGFUNDS (segregated funds) a critical module of Unitrax and acted as Offshore Subject Matter Expert  on this module supporting other team members , resolving queries and reviewing code.","Created a tool to validate the existence of required documents compliant with the SDLC lifecycle and generate a consolidated report  with the findings (using Windows Powershell).","Redesigned existing tool to achieve optimization in terms of execution time to generate automated resource work allocation status report (using embedded SQL with VBA ).","Made enhancements to a tool that tracks large object size in local development library."
       ]
      }
    ]
  },
  "projects": [],
  "education": {
    "summary": "",
    "level": "degree",
    "degree": "B.Tech",
    "history": [
      {
        "institution": "JIS College of Engineering",
        "title": "B.Tech",
        "url": "",
        "start": "2008",
        "end": "2011",
        "grade": "8.3",
        "summary": "",
        "curriculum": []
      },
      {
        "institution": "St. Xavier's School",
        "title": "Higher Secondary",
        "url": "",
        "start": "2005",
        "end": "2007",
        "grade": "75",
        "summary": "",
        "curriculum": []
      },
      {
        "institution": "St. Xavier's School",
        "title": "Secondary",
        "url": "",
        "start": "",
        "end": "2005",
        "grade": "83",
        "summary": "",
        "curriculum": []
      }
    ]
  },
  "service": {},
  "skills": {
    "sets": [
      {
        "name": "Programming Languages",
        "level": "",
        "skills": [
          "Python",
          "JavaScript",
          "Java",
          "SQL",
	  "COBOL/400",
	  "Control Language (CL) for IBM i",
	  "Bash Scripting"
        ]
      },
      {
        "name": "Databases",
        "level": "",
        "skills": [
          "DB2",
          "MySQL",
	  "Sqlite",
          "MongoDB"
        ]
      },
      {
        "name": "Tools/Libraries/Frameworks",
        "level": "",
        "skills": [
          "Git",
          "Node.js",
 	  "Express.js",
	  "Vagrant",
	  "Docker",
          "openpyxl",
	  "numpy",
	  "pandas"
        ]
      }
    ],
    "list": []
  },
 "samples": [
  ],
  "writing": [],
  "reading": [],
  "recognition": [
    {
      "flavor": "award",
      "from": "LTI",
      "title": "BFS ACE award for Best Individual Performance",
      "event": "",
      "url": "",
      "date": "",
      "summary": "Awarded for individual outstanding performance in project  for displaying good analytical skills and technical expertise that contributed to efficient technical design that was well received and appreciated by the clients."
    },
    {
      "flavor": "award",
      "from": "LTI",
      "title": "BFS Pat on the Back ",
      "event": "",
      "date": "",
      "summary": "Awarded for being able to quickly grasp the business functionalities , work independently and active efforts to learn and contribute significantly to the application development team."
    },
    {
      "flavor": "award",
      "from": "NTT DATA",
      "title": "Emerging Star Award",
      "event": "",
      "date": "",
      "summary": "Awarded for displaying great potential while handling new client account"
    },
    {
      "flavor": "award",
      "from": "NTT DATA",
      "title": "Spot Award",
      "event": "",
      "date": "",
      "summary": "Awarded for technical contribution and training the new recruits"
    }
  ],
  "references": [],
  "testimonials": [],
  "languages": [
    {
      "language": "English",
      "level": "read/write"
    },
    {
      "language": "Bengali",
      "level": "native"
    },
    {
      "language": "Hindi",
      "level": "read/write"
    }
  ],
  "interests": [
    {
      "name": "Art",
      "summary": "Have a great passion for arts, sketching and sculpture",
      "keywords": []
    },
    {
      "name": "Music",
      "summary": "An Audiophile",
      "keywords": []
    },
    {
      "name": "Reading",
      "summary": "Like to read, mostly non-fiction / self development books and articles",
      "keywords": []
    }

  ]
}
